Revit 2026 API

# ProjectPosition Properties

---

The ProjectPosition type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Angle | Angle from True North. |
|  | EastWest | East/West offset. |
|  | Elevation | Elevation above ground level. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | NorthSouth | North/South offset |

#### Reference

ProjectPosition Class

Autodesk.Revit.DB Namespace